Revit 2027 API
RevitLinkGraphicsSettings.SetDiscipline Method
 Sets discipline and discipline type of RevitLinkGraphicsSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDiscipline(
	LinkVisibility disciplineType,
	ViewDiscipline discipline
)
Public Sub SetDiscipline (
	disciplineType As LinkVisibility,
	discipline As ViewDiscipline
)
public:
void SetDiscipline(
	LinkVisibility disciplineType,
	ViewDiscipline discipline
)
member SetDiscipline :
        disciplineType : LinkVisibility *
        discipline : ViewDiscipline -> unit
Parameters
disciplineType LinkVisibility
 The type of the discipline.
discipline ViewDiscipline
 The discipline. If disciplineType is set to ByHostView or ByLinkView the discipline must be set to Architectural.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace